## 代码7-1

In [7]:
import pandas as pd 
df = pd.DataFrame({"key":['张三','李四','王五','王五','李四','张三'],
                  "data":[2,4,6,8,10,13]})
print(df)

  key  data
0  张三     2
1  李四     4
2  王五     6
3  王五     8
4  李四    10
5  张三    13

## 代码7-2

In [8]:
#按照“key”列数据进行分组，使用列索引字段
group1 = df.groupby(by='key')
#遍历查看
for item in group1:
    print(item)

('张三',   key  data
0  张三     2
5  张三    13)
('李四',   key  data
1  李四     4
4  李四    10)
('王五',   key  data
2  王五     6
3  王五     8)

## 代码7-3

In [10]:
#按Series 对象分组
df = pd.DataFrame({"key1":['张三','张三','李四','李四','张三'],
"key2":['one','two','one','two','one'],
"data1":[2,3,4,6,8],
"data2":[3,5,6,3,7]})
print(df)

  key1 key2  data1  data2
0   张三  one      2      3
1   张三  two      3      5
2   李四  one      4      6
3   李四  two      6      3
4   张三  one      8      7

## 代码7-4

In [12]:
se = pd.Series(['a','b','a','c','b'])
group2 = df.groupby(by=se)
for item in group2:
    print(item)

('a',   key1 key2  data1  data2
0   张三  one      2      3
2   李四  one      4      6)
('b',   key1 key2  data1  data2
1   张三  two      3      5
4   张三  one      8      7)
('c',   key1 key2  data1  data2
3   李四  two      6      3)

## 代码7-5

In [13]:
#Series 对象与pandas 对象的索引长度不相同
se = pd.Series(['a','b','a'])
group2 = df.groupby(by=se)
for item in group2:
    print(item)

('a',   key1 key2  data1  data2
0   张三  one      2      3
2   李四  one      4      6)
('b',   key1 key2  data1  data2
1   张三  two      3      5)

## 代码7-6

In [14]:
#按字典分组
df = pd.DataFrame({"a":[1,3,5,7,9],
"b":[2,3,4,6,8],
"c":[5,4,3,2,1],
"d":[3,5,6,3,7]})
#定义映射关系
mapping = {'a':'一组','b':'二组','c':'二组','d':'一组'}
group3 = df.groupby(by=mapping, axis=1)
for item in group3:
    print(item)

('一组',    a  d
0  1  3
1  3  5
2  5  6
3  7  3
4  9  7)
('二组',    b  c
0  2  5
1  3  4
2  4  3
3  6  2
4  8  1)

## 代码7-7

In [16]:
#按函数分组
df = pd.DataFrame({"a":[1,3,5],
"b":[2,3,4],
"c":[5,4,3]},
index=['张三','李四六','王五七'])
print(df)

     a  b  c
张三   1  2  5
李四六  3  3  4
王五七  5  4  3

## 代码7-8

In [17]:
#按照长度函数分组
#传递长度len 函数
group4 = df.groupby(len)
for item in group4:
    print(item)

(2,     a  b  c
张三  1  2  5)
(3,      a  b  c
李四六  3  3  4
王五七  5  4  3)

## 代码7-9

In [19]:
import numpy as np
data = pd.read_csv('./student.csv')
print(data)

      a   b   c
0  bill  12  45
1  mike  15  23
2  bill  34  88
3  bill  98  23

## 代码7-10

In [20]:
data.groupby(by='a').agg({'b':'max'})

       b
a
bill  98
mike  15

## 代码7-11

In [21]:
data.groupby(by='a').agg({'b':['max','min']})

       b
     max min
a
bill  98  12
mike  15  15

## 代码7-12

In [22]:
data.groupby(by='a').agg({'b':['max','min'], 'c':'min'})

       b       c
     max min min
a
bill  98  12  23
mike  15  15  23

## 代码7-13

In [23]:
data.groupby(by='a').agg(b_min=pd.NamedAgg(column='b', aggfunc='min'),
b_max=pd.NamedAgg(column='b', aggfunc='max'))
#按a 列分组后b 列的最大值和最小值，并重命名列名

      b_min  b_max
a
bill     12     98
mike     15     15

## 代码7-14

In [27]:
import numpy as np
data=pd.DataFrame({'a':[1,1,1,1],'b':[12,15,34,98],'c':[45,23,88,23]})
data.apply(np.mean)

a     1.00
b    39.75
c    44.75
dtype: float64

## 代码7-15

In [28]:
data.apply(np.mean, axis=1)

0    19.333333
1    13.000000
2    41.000000
3    40.666667
dtype: float64

## 代码7-16

In [30]:
data.apply(lambda x : x.max()-x.mean())

a     0.00
b    58.25
c    43.25
dtype: float64

## 代码7-17

In [31]:
data.apply(lambda x : x + 1)

   a   b   c
0  2  13  46
1  2  16  24
2  2  35  89
3  2  99  24

## 代码7-18

In [32]:
def subtract_and_divide(x, sub, divide=1):
    return (x - sub) / divide
data.apply(subtract_and_divide, args=(5,), divide=3)

          a          b          c
0 -1.333333   2.333333  13.333333
1 -1.333333   3.333333   6.000000
2 -1.333333   9.666667  27.666667
3 -1.333333  31.000000   6.000000

## 代码7-19

In [36]:
def subtract_and_divide(x, sub, divide=1):
    return (x - sub) / divide
data.loc[:,['a', 'b']].apply(subtract_and_divide, args=(5,), divide=3)

          a          b
0 -1.333333   2.333333
1 -1.333333   3.333333
2 -1.333333   9.666667
3 -1.333333  31.000000

## 代码7-20

In [37]:
import numpy as np
data = pd.read_csv('./student.csv')
print(data)

      a   b   c
0  bill  12  45
1  mike  15  23
2  bill  34  88
3  bill  98  23

## 代码7-21

In [38]:
data.groupby('a').transform(np.mean)

      b     c
0  48.0  52.0
1  15.0  23.0
2  48.0  52.0
3  48.0  52.0

## 代码7-22

In [39]:
def demean(arr):
    return arr - arr.mean()
data.groupby('a').transform(demean)

      b     c
0 -36.0  -7.0
1   0.0   0.0
2 -14.0  36.0
3  50.0 -29.0